app/Controllers/AdministradorController.php

    public function index()
    {
        $email = $this->request->getPost('txt_usuario');
        $contra = $this->request->getPost('txt_contra');

        $usuarios = new AdministradorModel();

        $datos = $usuarios->where('email',$email)
            ->where('password',$contra)
            ->first();
---
SELECT *
FROM `administrador`
WHERE `email` = 'ian@gmail.com'
AND `password` = 'ian123'
 LIMIT 1