app/Controllers/EquiposController.php

SELECT *
FROM `equipos`
---
    public function index(): string
    {
        $equipos = new EquiposModel();

        $datos['datos'] = $equipos->findAll();