app/Controllers/PagosController.php

SELECT *
FROM `pagos`
---
    public function index(): string
    {
        $pagos = new PagosModel();

        $datos['datos'] = $pagos->findAll();