app/Controllers/UsuariosController.php

SELECT *
FROM `usuarios`
---
    public function index(): string
    {
        $usuarios = new UsuariosModel();

        $datos['datos'] = $usuarios->findAll();